InformationRegisters/КодыОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>КодыОрганизации</Name>
			<Comment>Параметры регистрации и коды организации </Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерРегистрации</Name>
					<Comment>Номер регистрации</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КемЗарегистрирована</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерРегистрацииПФ</Name>
					<Comment>Номер регистрации в ПФ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>19</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерРегистрацииВСлужбеЗанятости</Name>
					<Comment>Номер регистрации в службе занятости</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НалоговаяИнспекция</Name>
					<Comment>Налоговая инспекция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеИнспекции</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоЕДРПОУ</Name>
					<Comment>Код ЕДРПОУ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИНН</Name>
					<Comment>Индивидуальный налоговый номер</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСвидетельства</Name>
					<Comment>Номер свидетельства</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодЗКГНГ</Name>
					<Comment>Код по ЗКГНГ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодСПОДУ</Name>
					<Comment>Код по СПОДУ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодКВЕД</Name>
					<Comment>Код по КВЕД</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодКОАТУУ</Name>
					<Comment>Код по КОАТУУ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодКФВ</Name>
					<Comment>Код КФВ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерФСС</Name>
					<Comment>Номер регистрации ФСС от временной потери трудоспособности</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерФССНесчСлучай</Name>
					<Comment>Номер регистрации в ФСС от несчастного случая</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отрасль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Территория</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФормаСобственности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОрганГУ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодОПФГ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОПФГ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодОрганаПФУ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НазваниеРабочегоОрганаФонда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФИОДиректораФонда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КлассПрофессиональногоРиска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОрганСоциальнойЗащитыНаселения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерФССУ</Name>
					<Comment>Номер регистрации ФСС Украины</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодКАТОТТГ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>19</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИсполнителиЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ИсполнителиЗадач</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГруппаИсполнителейЗадач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыИсполнителейЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>РольИсполнителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОсновнойОбъектАдресации</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ОбъектыАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДополнительныйОбъектАдресации</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ОбъектыАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДомов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКорпусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКвартир</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.СервисныеЦентры</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛичныеКонтакты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СхемыНалогообложенияКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СхемыНалогообложенияКонтрагентов</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СхемаНалогообложения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СхемыНалогообложения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаПлательщикаЕдиногоНалога</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ГруппыПлательщиковЕдиногоНалога</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/vrgРазработкаКлиентСервер/Ext/Module.bsl
//+BalakoD 20230116
Процедура ВыгрузитьФайл(Документ) Экспорт
		
	Если Документ.СчетОрганизации.Банк.ВариантВыгрузкиКлиентБанк = Перечисления.ВариантВыгрузкиКлиентБанк.Укргазбанк Тогда 
		ПутьФайлаВыгрузки = Документ.СчетОрганизации.Банк.ПутьФайлаВыгрузки;
		
		Если НЕ ЗначениеЗаполнено(ПутьФайлаВыгрузки) Тогда
			Возврат;
		КонецЕсли;	
		
		ПутьКаталог = ПутьФайлаВыгрузки + "\"+Документ.Организация+"\"+Документ.СчетОрганизации.Банк;
		ПутьКаталог = СтрЗаменить(ПутьКаталог,Символ(34),"");
		СоздатьКаталог(ПутьКаталог);
		ПутьКФайлу = ПутьКаталог+"\export.xls";
		
		
		ТабДокумент = Новый ТабличныйДокумент;
		ФайлСуществует = ФайлСуществует(ПутьКФайлу);
		Если ФайлСуществует Тогда
			ТаблицаДанных = ПодготовитьТаблицуСДанными(ПутьКФайлу);
			УдалитьФайлы(ПутьКФайлу);
		Иначе	
			ТаблицаДанных = Новый ТаблицаЗначений;
			ТаблицаДанных.Колонки.Добавить("FIELD_CUST_BANK_CODE");
			ТаблицаДанных.Колонки.Добавить("FIELD_CUST_ACCOUNT");
			ТаблицаДанных.Колонки.Добавить("FIELD_CUST_IBAN");
			ТаблицаДанных.Колонки.Добавить("FIELD_BENEF_BANK_CODE");
			ТаблицаДанных.Колонки.Добавить("FIELD_BENEF_ACCOUNT");
			ТаблицаДанных.Колонки.Добавить("FIELD_BENEF_IBAN");
			ТаблицаДанных.Колонки.Добавить("FIELD_OPERATION_TYPE");
			ТаблицаДанных.Колонки.Добавить("FIELD_AMOUNT");
			ТаблицаДанных.Колонки.Добавить("FIELD_DOCUMENT_TYPE");
			ТаблицаДанных.Колонки.Добавить("FIELD_NUMBER");
			ТаблицаДанных.Колонки.Добавить("FIELD_CURRENCY_NUMBER");
			ТаблицаДанных.Колонки.Добавить("FIELD_DOCUMENT_DATE");
			ТаблицаДанных.Колонки.Добавить("FIELD_VALUE_DATE");
			ТаблицаДанных.Колонки.Добавить("FIELD_CUST_NAME");
			ТаблицаДанных.Колонки.Добавить("FIELD_BENEF_NAME");
			ТаблицаДанных.Колонки.Добавить("FIELD_PURPOSE");
			ТаблицаДанных.Колонки.Добавить("FIELD_ADDITIONAL_DATA");
			ТаблицаДанных.Колонки.Добавить("FIELD_PURPOSE_CODE");
			ТаблицаДанных.Колонки.Добавить("FIELD_EMPTY_COLUMN");
			ТаблицаДанных.Колонки.Добавить("FIELD_CUST_TAX_CODE");
			ТаблицаДанных.Колонки.Добавить("FIELD_BENEF_TAX_CODE");
			ТаблицаДанных.Колонки.Добавить("FIELD_EXT_DOCUMENT_NUMBER");
			ТаблицаДанных.Колонки.Добавить("FIELD_VAT_TYPE");
		КонецЕсли;
		
		//МенеджерЗаписи = РегистрыСведений.КодыОрганизации.СоздатьМенеджерЗаписи();
		//МенеджерЗаписи.Организация = Документ.Организация;
		//МенеджерЗаписи.Прочитать();
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ДатаСрез", Документ.Дата);
		Запрос.УстановитьПараметр("Организация", Документ.Организация);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	КодыОрганизацииСрезПоследних.КодПоЕДРПОУ
		|ИЗ
		|	РегистрСведений.КодыОрганизации.СрезПоследних(&ДатаСрез, Организация = &Организация) КАК КодыОрганизацииСрезПоследних";
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если НЕ Выборка.Следующий() Тогда
			Возврат;
		КонецЕсли;	
		
		СтрокаВыписки = ТаблицаДанных.Добавить();
		СтрокаВыписки.FIELD_CUST_BANK_CODE 	= Строка(Документ.СчетОрганизации.Банк.Код);
		СтрокаВыписки.FIELD_CUST_IBAN 		= Строка(Документ.СчетОрганизации.НомерСчета);
		СтрокаВыписки.FIELD_BENEF_BANK_CODE = Строка(Документ.СчетКонтрагента.Банк.Код);
		СтрокаВыписки.FIELD_BENEF_IBAN 		= Строка(Документ.СчетКонтрагента.НомерСчета);
		ДатаБезФормат 						= Формат(Документ.СуммаДокумента, "ЧДЦ=2");
		СтрокаВыписки.FIELD_AMOUNT 			= СтрЗаменить(ДатаБезФормат,Символы.НПП,"");
		
		Если Документ.Контрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
			СтрокаВыписки.FIELD_DOCUMENT_TYPE = "1";
		КонецЕсли;	
		
		Если Документ.ВалютаДокумента = Справочники.Валюты.НайтиПоКоду(980) Тогда
			СтрокаВыписки.FIELD_CURRENCY_NUMBER = "UAH";
		ИначеЕсли Документ.ВалютаДокумента = Справочники.Валюты.НайтиПоКоду(840) Тогда
			СтрокаВыписки.FIELD_CURRENCY_NUMBER = "USD";
		ИначеЕсли Документ.ВалютаДокумента = Справочники.Валюты.НайтиПоКоду(978) Тогда
			СтрокаВыписки.FIELD_CURRENCY_NUMBER = "EUR";
		КонецЕсли;	
		
		ДатаДень							= ?(День(Документ.Дата) < 10,"'0" + День(Документ.Дата), Строка(День(Документ.Дата)));
		ДатаМесяц							= ?(Месяц(Документ.Дата) < 10,"0" + Месяц(Документ.Дата), Строка(Месяц(Документ.Дата)));
		ДатаГод								= Формат(Год(Документ.Дата), "ЧГ=0");
		СтрокаВыписки.FIELD_DOCUMENT_DATE	= ДатаДень + ДатаМесяц + ДатаГод;
		СтрокаВыписки.FIELD_CUST_NAME 		= Документ.Организация.Наименование;
		СтрокаВыписки.FIELD_PURPOSE 		= ЗаменаИУкр(Документ.НазначениеПлатежа);
		СтрокаВыписки.FIELD_CUST_TAX_CODE 	= Строка(Выборка.КодПоЕДРПОУ);
		Если ЗначениеЗаполнено(Документ.Контрагент) Тогда
			//Дандали В. 26.12.2023 поле должно заполняться как строка т.к. в некоторых ЕДРПОУ есть лидирующие нули.
			СтрокаВыписки.FIELD_BENEF_TAX_CODE 	= Строка(Документ.Контрагент.КодПоЕДРПОУ);
			СтрокаВыписки.FIELD_BENEF_NAME 		= ЗаменаИУкр(Документ.Контрагент.Наименование);
		Иначе
			СтрокаВыписки.FIELD_BENEF_TAX_CODE 	= Строка(Выборка.КодПоЕДРПОУ);
			СтрокаВыписки.FIELD_BENEF_NAME 		= ЗаменаИУкр(Документ.Организация.Наименование);
		КонецЕсли;	
		
		Если Документ.РасшифровкаПлатежа[0].СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
			СтрокаВыписки.FIELD_VAT_TYPE 	= "0";
		ИначеЕсли Документ.РасшифровкаПлатежа[0].СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
			СтрокаВыписки.FIELD_VAT_TYPE 	= "1";
		КонецЕсли;
		
		//Построитель = Новый ПостроительОтчета;
		//Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТаблицаДанных);       
		//Построитель.Вывести(ТабДокумент);
		//
		//ТабДокумент.Записать(ПутьКФайлу, ТипФайлаТабличногоДокумента.XLS);
		ВыгрузкаВЭксель(ТаблицаДанных, ПутьКФайлу);
	ИначеЕсли Документ.СчетОрганизации.Банк.ВариантВыгрузкиКлиентБанк = Перечисления.ВариантВыгрузкиКлиентБанк.КредитДнепр Тогда
		
		ПутьФайлаВыгрузки = Документ.СчетОрганизации.Банк.ПутьФайлаВыгрузки;
		
		Если НЕ ЗначениеЗаполнено(ПутьФайлаВыгрузки) Тогда
			Возврат;
		КонецЕсли;	
		
		ПутьКаталог = ПутьФайлаВыгрузки + "\"+Документ.Организация+"\"+Документ.СчетОрганизации.Банк;
		ПутьКаталог = СтрЗаменить(ПутьКаталог,Символ(34),"");
		СоздатьКаталог(ПутьКаталог);
		ПутьКФайлу = ПутьКаталог+"\export.dbf";
		
		
		ТабДокумент = Новый ТабличныйДокумент;
		ФайлСуществует = ФайлСуществует(ПутьКФайлу);
		Если ФайлСуществует Тогда
			ТаблицаДанных = ПодготовитьТаблицуСДаннымиDBF(ПутьКФайлу);
			УдалитьФайлы(ПутьКФайлу);
		Иначе
			ТаблицаДанных = Новый ТаблицаЗначений;
			ТаблицаДанных.Колонки.Добавить("ACCOUNTA");
			ТаблицаДанных.Колонки.Добавить("ACCOUNTB");
			ТаблицаДанных.Колонки.Добавить("NAMEB");
			ТаблицаДанных.Колонки.Добавить("OKPOB");
			ТаблицаДанных.Колонки.Добавить("MFOB");
			ТаблицаДанных.Колонки.Добавить("SUMMAVKOP");
			ТаблицаДанных.Колонки.Добавить("GOAL");
			ТаблицаДанных.Колонки.Добавить("VDATE");
			ТаблицаДанных.Колонки.Добавить("DOC_DATE");
			ТаблицаДанных.Колонки.Добавить("DOC_NUM");	
			ТаблицаДанных.Колонки.Добавить("TAX_XML");
		КонецЕсли;	
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ДатаСрез", Документ.Дата);
		Запрос.УстановитьПараметр("Организация", Документ.Организация);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	КодыОрганизацииСрезПоследних.КодПоЕДРПОУ
		|ИЗ
		|	РегистрСведений.КодыОрганизации.СрезПоследних(&ДатаСрез, Организация = &Организация) КАК КодыОрганизацииСрезПоследних";
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если НЕ Выборка.Следующий() Тогда
			Возврат;
		КонецЕсли;	
		
		НазначениеПлатежа = Документ.НазначениеПлатежа;
		НазначениеПлатежа = СтрЗаменить(НазначениеПлатежа, Символы.ПС, " ");
		НазначениеПлатежа = СтрЗаменить(НазначениеПлатежа, Символы.Таб, " ");
		НазначениеПлатежа = СтрЗаменить(НазначениеПлатежа, Символы.ВТаб, " ");
		НазначениеПлатежа = СтрЗаменить(НазначениеПлатежа, Символы.ВК, " ");
		НазначениеПлатежа = СтрЗаменить(НазначениеПлатежа, Символы.НПП, " ");
		НазначениеПлатежа = СтрЗаменить(НазначениеПлатежа, Символы.ПФ, " ");
		//Дандали В. 18.07.2024 +
		НазначениеПлатежа = СтрЗаменить(НазначениеПлатежа, "'", "'");
		НазначениеПлатежа = СтрЗаменить(НазначениеПлатежа, "«", """");
		НазначениеПлатежа = СтрЗаменить(НазначениеПлатежа, "»", """");
		//Дандали В. 18.07.2024 -
		

		//Дандали В. 21.12.2023
		НазначениеПлатежаНалоги = СформироватьСтрокуXML(Документ);//Строка XML
		//Дандали В. 21.12.2023
		
		СтрокаВыписки = ТаблицаДанных.Добавить();
		СтрокаВыписки.ACCOUNTA 	= Строка(Документ.СчетОрганизации.НомерСчета);
		СтрокаВыписки.ACCOUNTB 	= Строка(Документ.СчетКонтрагента.НомерСчета);
		
		Если ЗначениеЗаполнено(Документ.Контрагент) Тогда
			СтрокаВыписки.OKPOB = ?(Строка(Документ.Контрагент.КодПоЕДРПОУ)="" или Строка(Документ.Контрагент.КодПоЕДРПОУ)=0,Строка(Документ.Контрагент.ИНН),Строка(Документ.Контрагент.КодПоЕДРПОУ));
			СтрокаВыписки.NAMEB = ЗаменаИУкр(Документ.Контрагент.Наименование);
		Иначе
			СтрокаВыписки.OKPOB = Строка(Выборка.КодПоЕДРПОУ);
			СтрокаВыписки.NAMEB = ЗаменаИУкр(Документ.Организация.Наименование);
		КонецЕсли;
		
		СтрокаВыписки.MFOB 		= Строка(Документ.СчетКонтрагента.Банк.Код);
		СтрокаВыписки.SUMMAVKOP = Формат(Документ.СуммаДокумента*100,"ЧГ=;ЧРД=.");
		СтрокаВыписки.GOAL 		= ЗаменаИУкр(СокрЛП(НазначениеПлатежа));
		СтрокаВыписки.VDATE 	= "";
		СтрокаВыписки.DOC_DATE 	= Формат(Документ.Дата, "ДЛФ=Д");
		СтрокаВыписки.DOC_NUM 	= ОбщегоНазначения.ПолучитьНомерНаПечать(Документ);
		СтрокаВыписки.TAX_XML 	= СтрЗаменить(СтрЗаменить(НазначениеПлатежаНалоги, Символы.ПС, ""), Символы.Таб,"");
		
		ВыгрузкаВDBF(ТаблицаДанных, ПутьКФайлу)		
		
	//Дандали В. 03.11.2023
	ИначеЕсли Документ.СчетОрганизации.Банк.ВариантВыгрузкиКлиентБанк = Перечисления.ВариантВыгрузкиКлиентБанк.Монобанк Тогда
		
		ПутьФайлаВыгрузки = Документ.СчетОрганизации.Банк.ПутьФайлаВыгрузки;
		
		Если НЕ ЗначениеЗаполнено(ПутьФайлаВыгрузки) Тогда
			Возврат;
		КонецЕсли;	
		
		ПутьКаталог = ПутьФайлаВыгрузки + "\"+Документ.Организация+"\"+Документ.СчетОрганизации.Банк;
		ПутьКаталог = СтрЗаменить(ПутьКаталог,Символ(34),"");
		СоздатьКаталог(ПутьКаталог);
		ПутьКФайлу = ПутьКаталог+"\export.dbf";
		
		ТабДокумент = Новый ТабличныйДокумент;
		ФайлСуществует = ФайлСуществует(ПутьКФайлу);
		Если ФайлСуществует Тогда
			ТаблицаДанных = ПодготовитьТаблицуСДаннымиDBF(ПутьКФайлу);
			УдалитьФайлы(ПутьКФайлу);
		Иначе
			ТаблицаДанных = Новый ТаблицаЗначений;
			ТаблицаДанных.Колонки.Добавить("n_doc");
			ТаблицаДанных.Колонки.Добавить("mfo_db");
			ТаблицаДанных.Колонки.Добавить("rr_db");
			ТаблицаДанных.Колонки.Добавить("naim_d");
			ТаблицаДанных.Колонки.Добавить("okpo_db");
			ТаблицаДанных.Колонки.Добавить("mfo_cr");
			ТаблицаДанных.Колонки.Добавить("rr_k");
			ТаблицаДанных.Колонки.Добавить("naim_k");
			ТаблицаДанных.Колонки.Добавить("okpo_cr");
			ТаблицаДанных.Колонки.Добавить("sum");
			ТаблицаДанных.Колонки.Добавить("sumeq");
			ТаблицаДанных.Колонки.Добавить("prizn");
			ТаблицаДанных.Колонки.Добавить("dat");
			ТаблицаДанных.Колонки.Добавить("dat_pr");
			ТаблицаДанных.Колонки.Добавить("kod_val");
			ТаблицаДанных.Колонки.Добавить("operat");
			ТаблицаДанных.Колонки.Добавить("dat_gn");
			ТаблицаДанных.Колонки.Добавить("dat_arc");
			ТаблицаДанных.Колонки.Добавить("tim_pr");
		КонецЕсли;	
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ДатаСрез", Документ.Дата);
		Запрос.УстановитьПараметр("Организация", Документ.Организация);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	КодыОрганизацииСрезПоследних.КодПоЕДРПОУ
		|ИЗ
		|	РегистрСведений.КодыОрганизации.СрезПоследних(&ДатаСрез, Организация = &Организация) КАК КодыОрганизацииСрезПоследних";
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если НЕ Выборка.Следующий() Тогда
			Возврат;
		КонецЕсли;	
		
		НазначениеПлатежа = Документ.НазначениеПлатежа;
		НазначениеПлатежа = СтрЗаменить(НазначениеПлатежа, Символы.ПС, " ");
		НазначениеПлатежа = СтрЗаменить(НазначениеПлатежа, Символы.Таб, " ");
		НазначениеПлатежа = СтрЗаменить(НазначениеПлатежа, Символы.ВТаб, " ");
		НазначениеПлатежа = СтрЗаменить(НазначениеПлатежа, Символы.ВК, " ");
		НазначениеПлатежа = СтрЗаменить(НазначениеПлатежа, Символы.НПП, " ");
		НазначениеПлатежа = СтрЗаменить(НазначениеПлатежа, Символы.ПФ, " ");

		СтрокаВыписки = ТаблицаДанных.Добавить();

		
		СтрокаВыписки.n_doc 	= ОбщегоНазначения.ПолучитьНомерНаПечать(Документ); 
		СтрокаВыписки.mfo_db 	= Строка(Документ.СчетОрганизации.Банк.Код);
		СтрокаВыписки.rr_db 	= Строка(Документ.СчетОрганизации.НомерСчета);
		СтрокаВыписки.naim_d 	= ЗаменаИУкр(Документ.Организация.Наименование);
		СтрокаВыписки.okpo_db 	= Строка(Выборка.КодПоЕДРПОУ);
		
		СтрокаВыписки.mfo_cr 	= Строка(Документ.СчетКонтрагента.Банк.Код);
		СтрокаВыписки.rr_k 		= Строка(Документ.СчетКонтрагента.НомерСчета);
		СтрокаВыписки.naim_k 	= ЗаменаИУкр(Документ.Контрагент.Наименование);
		СтрокаВыписки.okpo_cr 	= Строка(Документ.Контрагент.КодПоЕДРПОУ);
		
		СтрокаВыписки.sum 		= Формат(Документ.СуммаДокумента,"ЧГ=;ЧРД=.");
		СтрокаВыписки.sumeq 	= Формат(Документ.СуммаДокумента,"ЧГ=;ЧРД=.");
		СтрокаВыписки.prizn 	= ЗаменаИУкр(СокрЛП(НазначениеПлатежа));
		СтрокаВыписки.kod_val   = Документ.ВалютаДокумента.Код;
		СтрокаВыписки.operat 	= "2";
		//СтрокаВыписки.dat_gn 	= ;
		//СтрокаВыписки.dat_arc 	= ;
		//СтрокаВыписки.tim_pr 	= ;
				
		ВыгрузкаDBFМонобанк(ТаблицаДанных, ПутьКФайлу);		
	
	//Дандали В. 03.11.2023
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьСтрокуXML(Документ)
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку(); 
		
	ЗаписьXML.ЗаписатьНачалоЭлемента("Tax"); 
	ЗаписьXML.ЗаписатьАтрибут("TaxPayTypeCode", СтрЗаменить(Документ.ТипОплатыБюджета.Код, "0", ""));
		ЗаписьXML.ЗаписатьНачалоЭлемента("Rcrd");
		
		ТелоXML = ПолучитьТелоДляXML(Документ.ТипОплатыБюджета, Документ);
		
		Для Каждого Элем из ТелоXML Цикл
			ЗаписьXML.ЗаписатьНачалоЭлемента(Элем.ИмяНалога);
				ЗаписьXML.ЗаписатьТекст(Строка(Элем.ЗначениеНалога));			
			ЗаписьXML.ЗаписатьКонецЭлемента(); 
		КонецЦикла;
		
		ЗаписьXML.ЗаписатьКонецЭлемента(); 
		
	ЗаписьXML.ЗаписатьКонецЭлемента(); 	
	
	стрВозврат = ЗаписьXML.Закрыть();
	
	Возврат стрВозврат;
КонецФункции

Функция ПолучитьТелоДляXML(ТипОплатыБюджета, Документ)
	
	СоответствиеНаименований = Новый Соответствие;
	СоответствиеНаименований.Вставить("КодВидаОплаты", "CertId");
	СоответствиеНаименований.Вставить("СуммаНалога", "TaxAmt");
	СоответствиеНаименований.Вставить("НомерСчета", "CtgyDtls");
	СоответствиеНаименований.Вставить("ДополнительнаяИнформация", "AddtlInf");
	СоответствиеНаименований.Вставить("ИнфоПроНалоговоеУведомление", "Ctgy");
	СоответствиеНаименований.Вставить("КодТипаКлассификацияДоходовБюджета", "Tp");
	
	тзВозврата = Новый ТаблицаЗначений;
	тзВозврата.Колонки.Добавить("ИмяНалога", Новый ОписаниеТипов(Новый КвалификаторыСтроки(50)));
	тзВозврата.Колонки.Добавить("ЗначениеНалога", Новый ОписаниеТипов(Новый КвалификаторыСтроки(50)));
	
	Для Каждого Элем из СоответствиеНаименований Цикл
		Попытка
			Если ТипОплатыБюджета[Элем.Ключ] Тогда
	         	НовСтр = тзВозврата.Добавить();
				НовСтр.ИмяНалога = СоответствиеНаименований[Элем.Ключ];
				Если НовСтр.ИмяНалога = "Tp" Тогда
						НовСтр.ЗначениеНалога = Документ[Элем.Ключ].Код;	
				Иначе
					НовСтр.ЗначениеНалога = Документ[Элем.Ключ];
				КонецЕсли;
			КонецЕсли;
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
	
	Возврат тзВозврата;
	
КонецФункции

Функция ФайлСуществует(Знач ПутьКФайлу) Экспорт 
	Файл = Новый Файл(ПутьКФайлу); 
	Возврат Файл.Существует(); 
КонецФункции

Функция ПодготовитьТаблицуСДанными(ПутьКФайлу)
	
	Таблица = Новый ТаблицаЗначений;
	
	//подключаемся к эксель
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Excel.WorkBooks.Open(ПутьКФайлу);
	Исключение
		Сообщить("Ошибка при открытии файла с помощью Excel! Загрузка не будет произведена!");
		Сообщить(ОписаниеОшибки());
		ЗакрытьExcel(Excel);
		Возврат Таблица;
	КонецПопытки;

	Попытка
		//Открываем необходимый лист
		Excel.Sheets(1).Select();
	Исключение
		//Закрываем Excel
		Excel.ActiveWorkbook.Close();
		Excel = 0;
		Сообщить("Лист №" + 1 + " не найден.");
		ОтменитьТранзакцию();
		ЗакрытьExcel(Excel);
		Возврат Таблица;
	КонецПопытки;

	//Получим количество строк и колонок.
	//В разных версиях Excel получаются по-разному, поэтому сначала определим версию Excel
	Версия = Лев(Excel.Version,Найти(Excel.Version,".")-1);
	Если Версия = "8" Тогда
		ФайлСтрок    = Excel.Cells.CurrentRegion.Rows.Count;
		ФайлКолонок  = Макс(Excel.Cells.CurrentRegion.Columns.Count, 13);
	Иначе
		ФайлСтрок    = Excel.Cells(1,1).SpecialCells(11).Row;
		ФайлКолонок  = Excel.Cells(1,1).SpecialCells(11).Column;
	Конецесли;

	Сч = 1;
	Пока ЗначениеЗаполнено(Excel.Cells(1, Сч).Text) Цикл
		ИмяКолонки      = Excel.Cells(1, Сч).Text;
		ИмяБезПробелов  = ПолучитьИмяКолонки(ИмяКолонки);
		
		Таблица.Колонки.Добавить(ИмяБезПробелов,,ИмяКолонки);

		Сч = Сч + 1;
	КонецЦикла;

	// указываем с какой строки начинать обработку
	Для НС = 2 по ФайлСтрок Цикл
		// Состояние("Файл "+Строка(ИмяФайла)+": Обрабатывается первый лист "+Строка(Формат(?(ФайлСтрок=0,0,((100*НС)/ФайлСтрок)),"ЧЦ=3; ЧДЦ=0"))+" %");
		//ОбработкаПрерыванияПользователя(); //указав данный оператор, цикл можно прервать в любой момент нажатие ctrl+break
		НоваяСтрока = Таблица.Добавить();
		Для НомерКолонки = 1 по Таблица.Колонки.Количество() Цикл
			//заполняем строку значениями
			ТекущееЗначение = Excel.Cells(НС, НомерКолонки).Text;
			ИмяКолонки = Таблица.Колонки[НомерКолонки-1].Имя;
			НоваяСтрока[ИмяКолонки] = ТекущееЗначение;
		КонецЦикла;
	КонецЦикла;

	ЗакрытьExcel(Excel);
	
	Возврат Таблица;
КонецФункции

Функция ПолучитьИмяКолонки(ИмяСтолбца)
	ИмяКолонки = СтрЗаменить(ИмяСтолбца, " ", "_");
	ИмяКолонки = СтрЗаменить(ИмяКолонки, "(", "");
	ИмяКолонки = СтрЗаменить(ИмяКолонки, ")", "");
	ИмяКолонки = СтрЗаменить(ИмяКолонки, "-", "");
	Возврат ИмяКолонки;
КонецФункции

Процедура ЗакрытьExcel(Excel)
	Excel.DisplayAlerts = 0; 
	Excel.Quit();
	Excel.DisplayAlerts = 1;
КонецПроцедуры

Процедура ВыгрузкаВЭксель(Т, ПутьКФайлу) Экспорт
	
	Попытка
		XL = Новый COMОбъект ("Excel.Application");
	Исключение
		Сообщить("Ошибка создания Excel.Application");
		Возврат;
	КонецПопытки;
	
	XL.Visible = 0;
	wb = XL.Workbooks.Add();
	sh = wb.Worksheets(1);
	Кол = Т.Колонки.Количество();
	
	Если Кол = 0 Тогда
		Возврат;
	КонецЕсли; 
	
	Для К = 1 По Кол Цикл
		Заг = Т.Колонки[К-1].Имя;
		sh.Cells(1,К).FormulaR1C1 = Заг;
	КонецЦикла;
	
	Для Каждого Стр Из Т Цикл
		Для К = 1 По Кол Цикл
			//Дандали В. 26.12.2023 колока с лидирующими нулями "FIELD_BENEF_TAX_CODE"
			Если К = 21 Тогда
				sh.Cells(Т.Индекс(Стр)+2, К).NumberFormat = "@";
			КонецЕсли;
			Зн = Стр[К-1];
			sh.Cells(Т.Индекс(Стр)+2, К).FormulaR1C1 = Строка(Зн);
		КонецЦикла;
	КонецЦикла;
	sh.Columns.AutoFit();	
	
	Попытка 
		wb.SaveAs(ПутьКФайлу, 51);
	Исключение
		Сообщить(ОписаниеОшибки());    
	КонецПопытки;
	ЗакрытьExcel(XL);  
	
КонецПроцедуры 

Процедура ВыгрузкаВDBF(Т, ПутьКФайлу)
	
	НовыйФайл = Новый XBase;
	//существует два вида кодировки ANSI (win) и OEM (dos)
	НовыйФайл.Кодировка = КодировкаXBase.OEM;
	//описываем колонки:
	НовыйФайл.Поля.Добавить("ACCOUNTA","S",30);
	НовыйФайл.Поля.Добавить("ACCOUNTB","S",30);
	НовыйФайл.Поля.Добавить("NAMEB","S",38);
	НовыйФайл.Поля.Добавить("OKPOB","S",14);
	НовыйФайл.Поля.Добавить("MFOB","S",10);
	НовыйФайл.Поля.Добавить("SUMMAVKOP","N",10);
	НовыйФайл.Поля.Добавить("GOAL","S",160);
	НовыйФайл.Поля.Добавить("VDATE","S",10);
	НовыйФайл.Поля.Добавить("DOC_DATE","S",10);
	НовыйФайл.Поля.Добавить("DOC_NUM","N",10);
	НовыйФайл.Поля.Добавить("TAX_XML", "S", 200);
	
	НовыйФайл.СоздатьФайл(ПутьКФайлу);
	НовыйФайл.Записать();
	
	Для Каждого СтрокаТ из Т Цикл
		
		НовыйФайл.Добавить();
		НовыйФайл.ACCOUNTA 	= СтрокаТ.ACCOUNTA;
		НовыйФайл.ACCOUNTB 	= СтрокаТ.ACCOUNTB;
		НовыйФайл.NAMEB 	= СтрокаТ.NAMEB;
		НовыйФайл.OKPOB 	= СтрокаТ.OKPOB;
		НовыйФайл.MFOB 		= СтрокаТ.MFOB;
		НовыйФайл.SUMMAVKOP = СтрокаТ.SUMMAVKOP;
		НовыйФайл.GOAL 		= СтрокаТ.GOAL;
		НовыйФайл.VDATE 	= СтрокаТ.VDATE;
		НовыйФайл.DOC_DATE 	= СтрокаТ.DOC_DATE;
		НовыйФайл.DOC_NUM 	= СтрокаТ.DOC_NUM;
		НовыйФайл.TAX_XML	= СтрокаТ.TAX_XML;
		НовыйФайл.Записать();
		
	КонецЦикла;	
	
КонецПроцедуры

Процедура ВыгрузкаDBFМонобанк(Т, ПутьКФайлу)
	
	НовыйФайл = Новый XBase;
	//существует два вида кодировки ANSI (win) и OEM (dos)
	НовыйФайл.Кодировка = КодировкаXBase.OEM;
	//описываем колонки:
	НовыйФайл.Поля.Добавить("n_doc","S",30);
	НовыйФайл.Поля.Добавить("mfo_db","S",10);
	НовыйФайл.Поля.Добавить("rr_db","S",30);
	НовыйФайл.Поля.Добавить("naim_d","S",38);
	НовыйФайл.Поля.Добавить("okpo_db","S",14);
	НовыйФайл.Поля.Добавить("mfo_cr","S",10);
	НовыйФайл.Поля.Добавить("rr_k","S",30);
	НовыйФайл.Поля.Добавить("naim_k","S",38);
	НовыйФайл.Поля.Добавить("okpo_cr","S",14);
	НовыйФайл.Поля.Добавить("sum", "N", 10);
	НовыйФайл.Поля.Добавить("sumeq", "N", 10);
	НовыйФайл.Поля.Добавить("prizn", "S", 160);
	НовыйФайл.Поля.Добавить("dat","S",30);
	НовыйФайл.Поля.Добавить("dat_pr","S",30);
	НовыйФайл.Поля.Добавить("kod_val","S",30);
	НовыйФайл.Поля.Добавить("operat","S",30);
	НовыйФайл.Поля.Добавить("dat_gn","S",30);
	НовыйФайл.Поля.Добавить("dat_arc","S",30);
	НовыйФайл.Поля.Добавить("tim_pr","S",30);
	
	НовыйФайл.СоздатьФайл(ПутьКФайлу);
	НовыйФайл.Записать();
	
	Для Каждого СтрокаТ из Т Цикл
		
		НовыйФайл.Добавить();
		ЗаполнитьЗначенияСвойств(НовыйФайл, СтрокаТ);
		НовыйФайл.Записать();
		
	КонецЦикла;	
	
КонецПроцедуры

Функция ПодготовитьТаблицуСДаннымиDBF(ПутьКФайлу)

	Таблица = Новый ТаблицаЗначений;
	
	Файл = Новый Файл(ПутьКФайлу);

	Если Файл.Существует() Тогда

		Если Файл.ЭтоКаталог() Тогда
			#Если клиент Тогда  
			Предупреждение("Указанный файл является каталогом, чтение невозможно!");
			#КонецЕсли
			Возврат Таблица;
		КонецЕсли;

	Иначе
		#Если клиент Тогда 
		Предупреждение("Указанный файл не существует!");
		#КонецЕсли
		Возврат Таблица;

	КонецЕсли;


	Файл = Новый XBase;

	Файл.ОткрытьФайл(ПутьКФайлу, , Истина);

	Файл.Кодировка = КодировкаXBase.OEM;

	Файл.Первая();


	Для Каждого Поле Из Файл.поля Цикл
		Название = Поле.Имя;
		Таблица.Колонки.Добавить(Название, , Название);
	КонецЦикла;


	ВсегоЗаписей  =  Файл.КоличествоЗаписей();

	Пока НЕ Файл.ВКонце() Цикл
		//ОбработкаПрерыванияПользователя();
		Если НЕ Файл.ЗаписьУдалена() Тогда
			НоваяСтрока = Таблица.Добавить();
			Для НомерКолонки = 1 по Таблица.Колонки.Количество() Цикл
				ИмяКолонки = Таблица.Колонки[НомерКолонки-1].Имя;
				НоваяСтрока[ИмяКолонки] = Файл[ИмяКолонки];
			КонецЦикла;
		КонецЕсли;
		Файл.Следующая();
	КонецЦикла;


	Файл.ЗакрытьФайл();

	Возврат Таблица;
	
КонецФункции

Функция ТекстЗапросаИзЧислаВСтроку(пИмяПоля, пДлинаЦел, пДлинаДробь, пЛидирующийСимвол="") Экспорт
    лЗапрос=Новый Запрос("ВЫБРАТЬ ВЫРАЗИТЬ(0.5 КАК ЧИСЛО (15, 0)) КАК Проверка");
    лВыборка=лЗапрос.Выполнить().Выбрать();
    лВыборка.Следующий();
    лЗапросОкругляетПоАрифметическимПравилам=лВыборка.Проверка=1;
    
    лТекст="ВЫБОР КОГДА "+пИмяПоля+"<0 Тогда ""-"" ИНАЧЕ """" КОНЕЦ "+Символы.ПС;
    лИмяПоляАбс=" ВЫБОР КОГДА "+пИмяПоля+"<0 ТОГДА -"+пИмяПоля+" ИНАЧЕ "+пИмяПоля+" КОНЕЦ ";
    лПараметр=Pow(10, пДлинаЦел-1);
    Для лИнд=1 По пДлинаЦел+пДлинаДробь цикл
        лТекст=лТекст+?(лИнд=пДлинаЦел+1, "+"".""+", "+");
        лТекст=лТекст+" ВЫБОР "+Символы.ПС+
        ?(лИнд<пДлинаЦел, " КОГДА "+лИмяПоляАбс+" < "+Формат(лПараметр, "ЧРД=.; ЧГ=")+" ТОГДА """+пЛидирующийСимвол+""" "+Символы.ПС, "");
        Для лЦифра=0 По 9 Цикл
            лТекст=лТекст+" КОГДА "+лИмяПоляАбс+"-"+Формат(лПараметр*10, "ЧРД=.; ЧГ=")+"*ВЫРАЗИТЬ(("+лИмяПоляАбс+?(лЗапросОкругляетПоАрифметическимПравилам, "-"+Формат(лПараметр*5, "ЧРД=.; ЧГ="), "")+")/"+Формат(лПараметр*10, "ЧРД=.; ЧГ=")+" КАК ЧИСЛО(15, 0))"+" >= "+Формат((9-лЦифра)*лПараметр, "ЧН=0; ЧРД=.; ЧГ=")+" ТОГДА """+Формат(9-лЦифра, "ЧН=0; ЧРД=.; ЧГ=")+""" "+Символы.ПС;
        КонецЦикла;
        лТекст=лТекст+" ИНАЧЕ ""0"""+Символы.ПС+" Конец "+Символы.ПС;
        лПараметр=лПараметр/10;
    КонецЦикла;
    Сообщить(лТекст); 
    Возврат лТекст;
КонецФункции

Функция ТекстЗапросаИзСтрокиВЧисло(пИмяПоля, пДлинаСтроки, пСимволРазделителя=".") Экспорт
    лТекст="ВЫБОР ";
    Для лДлинаЦелойЧасти=0 По пДлинаСтроки Цикл
        Если лДлинаЦелойЧасти=пДлинаСтроки Тогда 
            лТекст=лТекст+"ИНАЧЕ"+Символы.ПС;
        Иначе
            лТекст=лТекст+"КОГДА ПОДСТРОКА("+пИмяПоля+", "+(лДлинаЦелойЧасти+1)+", 1)="""+пСимволРазделителя+""" ИЛИ ПОДСТРОКА("+пИмяПоля+", "+(лДлинаЦелойЧасти+1)+", 1)="""" ТОГДА "+Символы.ПС;
        КонецЕсли; 
        Если лДлинаЦелойЧасти=0 Тогда лТекст=лТекст+"    0"+Символы.ПС; КонецЕсли; 
        Для лИнд=1 По лДлинаЦелойЧасти Цикл
            лТекст=лТекст+"    ВЫБОР "+Символы.ПС;
            Для лЦифра=0 По 9 Цикл
                лТекст=лТекст+"    КОГДА ПОДСТРОКА("+пИмяПоля+", "+лИнд+", 1)="""+лЦифра+""" ТОГДА "+лЦифра+Символы.ПС;
            КонецЦикла;
            лТекст=лТекст+"    ИНАЧЕ 0 КОНЕЦ"+?(лИнд=лДлинаЦелойЧасти, "", "*"+Формат(Pow(10, лДлинаЦелойЧасти-лИнд), "ЧРД=.; ЧГ=0")+"+")+Символы.ПС;
        КонецЦикла;
        Для лИнд=лДлинаЦелойЧасти+2 По пДлинаСтроки Цикл
            лТекст=лТекст+"+ ВЫБОР";
            Для лЦифра=0 По 9 Цикл
                лТекст=лТекст+"    КОГДА ПОДСТРОКА("+пИмяПоля+", "+лИнд+", 1)="""+лЦифра+""" ТОГДА "+лЦифра+Символы.ПС;
            КонецЦикла;
            лТекст=лТекст+"    ИНАЧЕ 0 КОНЕЦ"+?(лИнд=лДлинаЦелойЧасти, "", "/"+Формат(Pow(10, лИнд-лДлинаЦелойЧасти-1), "ЧРД=.; ЧГ=0"))+Символы.ПС;
        КонецЦикла;
    КонецЦикла;
    лТекст=лТекст+"КОНЕЦ";
    Возврат лТекст;
КонецФункции

Функция ЗаменаИУкр(СтрокаЗамены) Экспорт
	
	Строка1 = СтрЗаменить(СтрокаЗамены, "і", "i"); 
	Строка2 = СтрЗаменить(Строка1, "І", "I");
	Возврат Строка2;
	
КонецФункции	

Процедура ОтправкаУведомлений() Экспорт
		Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЭлектронноеПисьмо.Ссылка
	               |ИЗ
	               |	Документ.ЭлектронноеПисьмо КАК ЭлектронноеПисьмо
	               |ГДЕ
	               |	ЭлектронноеПисьмо.Уведомление
	               |	И ЭлектронноеПисьмо.ДатаОтправления = &ДатаОтправления
	               |	И ЭлектронноеПисьмо.УчетнаяЗапись = &УчетнаяЗапись";
	Запрос.УстановитьПараметр("ДатаОтправления",Дата(1,1,1));
	Запрос.УстановитьПараметр("УчетнаяЗапись",Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоКоду("000000001"));

	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаРезультат из РезультатЗапроса цикл
		Об = СтрокаРезультат.ссылка.ПолучитьОбъект();	
		об.ОтправитьПисьмо();
		Об.Записать();
	КонецЦикла;

КонецПроцедуры
//-BalakoD 20230116

// t.me/konstantyn_buhantsev [13 лютого 2025 р.] --> 
Процедура ВыгрузитьПоМассивуДокументов(МассивДокументов, СчетОрганизации) Экспорт
	
	ВариантВыгрузки = СчетОрганизации.Банк.ВариантВыгрузкиКлиентБанк;
	
	Если ВариантВыгрузки = Перечисления.ВариантВыгрузкиКлиентБанк.Укргазбанк Тогда
		
		ВыгрузитьУкргазбанк(МассивДокументов, СчетОрганизации);	
		
	ИначеЕсли ВариантВыгрузки = Перечисления.ВариантВыгрузкиКлиентБанк.КредитДнепр Тогда
		
		ВыгрузитьКредитДнепр(МассивДокументов, СчетОрганизации);
		
	ИначеЕсли ВариантВыгрузки = Перечисления.ВариантВыгрузкиКлиентБанк.Монобанк Тогда	
		
		ВыгрузитьМонобанк(МассивДокументов, СчетОрганизации);
		
	Иначе
		
		Сообщить("Нет программы для выгрузки");
		Возврат;
		
	КонецЕсли; 	
	
	
КонецПроцедуры

Процедура ВыгрузитьУкргазбанк(МассивДокументов, СчетОрганизации)
	
	ПутьФайлаВыгрузки = СчетОрганизации.Банк.ПутьФайлаВыгрузки;
		
	Если НЕ ЗначениеЗаполнено(ПутьФайлаВыгрузки) Тогда
		Сообщить("Не заполнен ПутьФайлаВыгрузки в Банке справочника Банковские счета.");
		Возврат;
	КонецЕсли;	
	
	ПутьКаталог = ПутьФайлаВыгрузки + "\"+СчетОрганизации.Владелец+"\"+СчетОрганизации.Банк;
	ПутьКаталог = СтрЗаменить(ПутьКаталог,Символ(34),"");
	СоздатьКаталог(ПутьКаталог);
	ПутьКФайлу = ПутьКаталог+"\export.xls";
	
	ТабДокумент = Новый ТабличныйДокумент;
	ФайлСуществует = ФайлСуществует(ПутьКФайлу);
	Если ФайлСуществует Тогда
		ТаблицаДанных = ПодготовитьТаблицуСДанными(ПутьКФайлу);
		УдалитьФайлы(ПутьКФайлу);
	Иначе	
		ТаблицаДанных = Новый ТаблицаЗначений;
		ТаблицаДанных.Колонки.Добавить("FIELD_CUST_BANK_CODE");
		ТаблицаДанных.Колонки.Добавить("FIELD_CUST_ACCOUNT");
		ТаблицаДанных.Колонки.Добавить("FIELD_CUST_IBAN");
		ТаблицаДанных.Колонки.Добавить("FIELD_BENEF_BANK_CODE");
		ТаблицаДанных.Колонки.Добавить("FIELD_BENEF_ACCOUNT");
		ТаблицаДанных.Колонки.Добавить("FIELD_BENEF_IBAN");
		ТаблицаДанных.Колонки.Добавить("FIELD_OPERATION_TYPE");
		ТаблицаДанных.Колонки.Добавить("FIELD_AMOUNT");
		ТаблицаДанных.Колонки.Добавить("FIELD_DOCUMENT_TYPE");
		ТаблицаДанных.Колонки.Добавить("FIELD_NUMBER");
		ТаблицаДанных.Колонки.Добавить("FIELD_CURRENCY_NUMBER");
		ТаблицаДанных.Колонки.Добавить("FIELD_DOCUMENT_DATE");
		ТаблицаДанных.Колонки.Добавить("FIELD_VALUE_DATE");
		ТаблицаДанных.Колонки.Добавить("FIELD_CUST_NAME");
		ТаблицаДанных.Колонки.Добавить("FIELD_BENEF_NAME");
		ТаблицаДанных.Колонки.Добавить("FIELD_PURPOSE");
		ТаблицаДанных.Колонки.Добавить("FIELD_ADDITIONAL_DATA");
		ТаблицаДанных.Колонки.Добавить("FIELD_PURPOSE_CODE");
		ТаблицаДанных.Колонки.Добавить("FIELD_EMPTY_COLUMN");
		ТаблицаДанных.Колонки.Добавить("FIELD_CUST_TAX_CODE");
		ТаблицаДанных.Колонки.Добавить("FIELD_BENEF_TAX_CODE");
		ТаблицаДанных.Колонки.Добавить("FIELD_EXT_DOCUMENT_NUMBER");
		ТаблицаДанных.Колонки.Добавить("FIELD_VAT_TYPE");
	КонецЕсли;
	
	Для каждого Документ Из МассивДокументов Цикл
	
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ДатаСрез", Документ.Дата);
		Запрос.УстановитьПараметр("Организация", Документ.Организация);
		Запрос.Текст =
				"ВЫБРАТЬ
				|	КодыОрганизацииСрезПоследних.КодПоЕДРПОУ
				|ИЗ
				|	РегистрСведений.КодыОрганизации.СрезПоследних(&ДатаСрез, Организация = &Организация) КАК КодыОрганизацииСрезПоследних";
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если НЕ Выборка.Следующий() Тогда
			Сообщить("РегистрСведений.КодыОрганизации, не найдена запись.");
			Продолжить;
		КонецЕсли;	
		
		СтрокаВыписки = ТаблицаДанных.Добавить();
		СтрокаВыписки.FIELD_CUST_BANK_CODE 	= Строка(Документ.СчетОрганизации.Банк.Код);
		СтрокаВыписки.FIELD_CUST_IBAN 		= Строка(Документ.СчетОрганизации.НомерСчета);
		СтрокаВыписки.FIELD_BENEF_BANK_CODE = Строка(Документ.СчетКонтрагента.Банк.Код);
		СтрокаВыписки.FIELD_BENEF_IBAN 		= Строка(Документ.СчетКонтрагента.НомерСчета);
		ДатаБезФормат 						= Формат(Документ.СуммаДокумента, "ЧДЦ=2");
		СтрокаВыписки.FIELD_AMOUNT 			= СтрЗаменить(ДатаБезФормат,Символы.НПП,"");
		
		Если Документ.Контрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
			СтрокаВыписки.FIELD_DOCUMENT_TYPE = "1";
		КонецЕсли;	
		
		Если Документ.ВалютаДокумента = Справочники.Валюты.НайтиПоКоду(980) Тогда
			СтрокаВыписки.FIELD_CURRENCY_NUMBER = "UAH";
		ИначеЕсли Документ.ВалютаДокумента = Справочники.Валюты.НайтиПоКоду(840) Тогда
			СтрокаВыписки.FIELD_CURRENCY_NUMBER = "USD";
		ИначеЕсли Документ.ВалютаДокумента = Справочники.Валюты.НайтиПоКоду(978) Тогда
			СтрокаВыписки.FIELD_CURRENCY_NUMBER = "EUR";
		КонецЕсли;	
		
		ДатаДень							= ?(День(Документ.Дата) < 10,"'0" + День(Документ.Дата), Строка(День(Документ.Дата)));
		ДатаМесяц							= ?(Месяц(Документ.Дата) < 10,"0" + Месяц(Документ.Дата), Строка(Месяц(Документ.Дата)));
		ДатаГод								= Формат(Год(Документ.Дата), "ЧГ=0");
		СтрокаВыписки.FIELD_DOCUMENT_DATE	= ДатаДень + ДатаМесяц + ДатаГод;
		СтрокаВыписки.FIELD_CUST_NAME 		= Документ.Организация.Наименование;
		СтрокаВыписки.FIELD_PURPOSE 		= ЗаменаИУкр(Документ.НазначениеПлатежа);
		СтрокаВыписки.FIELD_CUST_TAX_CODE 	= Строка(Выборка.КодПоЕДРПОУ);
		Если ЗначениеЗаполнено(Документ.Контрагент) Тогда
			//Дандали В. 26.12.2023 поле должно заполняться как строка т.к. в некоторых ЕДРПОУ есть лидирующие нули.
			СтрокаВыписки.FIELD_BENEF_TAX_CODE 	= Строка(Документ.Контрагент.КодПоЕДРПОУ);
			СтрокаВыписки.FIELD_BENEF_NAME 		= ЗаменаИУкр(Документ.Контрагент.Наименование);
		Иначе
			СтрокаВыписки.FIELD_BENEF_TAX_CODE 	= Строка(Выборка.КодПоЕДРПОУ);
			СтрокаВыписки.FIELD_BENEF_NAME 		= ЗаменаИУкр(Документ.Организация.Наименование);
		КонецЕсли;	
		
		Если Документ.РасшифровкаПлатежа[0].СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
			СтрокаВыписки.FIELD_VAT_TYPE 	= "0";
		ИначеЕсли Документ.РасшифровкаПлатежа[0].СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
			СтрокаВыписки.FIELD_VAT_TYPE 	= "1";
		КонецЕсли;
	
	КонецЦикла;
	
	ВыгрузкаВЭксель(ТаблицаДанных, ПутьКФайлу);
	
КонецПроцедуры

Процедура ВыгрузитьКредитДнепр(МассивДокументов, СчетОрганизации)
	
	ПутьФайлаВыгрузки = СчетОрганизации.Банк.ПутьФайлаВыгрузки;
		
	Если НЕ ЗначениеЗаполнено(ПутьФайлаВыгрузки) Тогда
		Сообщить("Не заполнен ПутьФайлаВыгрузки в Банке справочника Банковские счета.");
		Возврат;
	КонецЕсли;	
	
	ПутьКаталог = ПутьФайлаВыгрузки + "\"+СчетОрганизации.Владелец+"\"+СчетОрганизации.Банк;
	ПутьКаталог = СтрЗаменить(ПутьКаталог,Символ(34),"");
	СоздатьКаталог(ПутьКаталог);
	ПутьКФайлу = ПутьКаталог+"\export.dbf";
	
	
	ТабДокумент = Новый ТабличныйДокумент;
	ФайлСуществует = ФайлСуществует(ПутьКФайлу);
	Если ФайлСуществует Тогда
		ТаблицаДанных = ПодготовитьТаблицуСДаннымиDBF(ПутьКФайлу);
		УдалитьФайлы(ПутьКФайлу);
	Иначе
		ТаблицаДанных = Новый ТаблицаЗначений;
		ТаблицаДанных.Колонки.Добавить("ACCOUNTA");
		ТаблицаДанных.Колонки.Добавить("ACCOUNTB");
		ТаблицаДанных.Колонки.Добавить("NAMEB");
		ТаблицаДанных.Колонки.Добавить("OKPOB");
		ТаблицаДанных.Колонки.Добавить("MFOB");
		ТаблицаДанных.Колонки.Добавить("SUMMAVKOP");
		ТаблицаДанных.Колонки.Добавить("GOAL");
		ТаблицаДанных.Колонки.Добавить("VDATE");
		ТаблицаДанных.Колонки.Добавить("DOC_DATE");
		ТаблицаДанных.Колонки.Добавить("DOC_NUM");	
		ТаблицаДанных.Колонки.Добавить("TAX_XML");
	КонецЕсли;	
	
	Для каждого Документ Из МассивДокументов Цикл
	
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ДатаСрез", Документ.Дата);
		Запрос.УстановитьПараметр("Организация", Документ.Организация);
		Запрос.Текст =
				"ВЫБРАТЬ
				|	КодыОрганизацииСрезПоследних.КодПоЕДРПОУ
				|ИЗ
				|	РегистрСведений.КодыОрганизации.СрезПоследних(&ДатаСрез, Организация = &Организация) КАК КодыОрганизацииСрезПоследних";
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если НЕ Выборка.Следующий() Тогда
			Сообщить("РегистрСведений.КодыОрганизации, не найдена запись.");
			Продолжить;
		КонецЕсли;	
		
		НазначениеПлатежа = Документ.НазначениеПлатежа;
		НазначениеПлатежа = СтрЗаменить(НазначениеПлатежа, Символы.ПС, " ");
		НазначениеПлатежа = СтрЗаменить(НазначениеПлатежа, Символы.Таб, " ");
		НазначениеПлатежа = СтрЗаменить(НазначениеПлатежа, Символы.ВТаб, " ");
		НазначениеПлатежа = СтрЗаменить(НазначениеПлатежа, Символы.ВК, " ");
		НазначениеПлатежа = СтрЗаменить(НазначениеПлатежа, Символы.НПП, " ");
		НазначениеПлатежа = СтрЗаменить(НазначениеПлатежа, Символы.ПФ, " ");
		НазначениеПлатежа = СтрЗаменить(НазначениеПлатежа, "'", "'");
		НазначениеПлатежа = СтрЗаменить(НазначениеПлатежа, "«", """");
		НазначениеПлатежа = СтрЗаменить(НазначениеПлатежа, "»", """");
		
		НазначениеПлатежаНалоги = СформироватьСтрокуXML(Документ);//Строка XML
		
		СтрокаВыписки = ТаблицаДанных.Добавить();
		СтрокаВыписки.ACCOUNTA 	= Строка(Документ.СчетОрганизации.НомерСчета);
		СтрокаВыписки.ACCOUNTB 	= Строка(Документ.СчетКонтрагента.НомерСчета);
		
		Если ЗначениеЗаполнено(Документ.Контрагент) Тогда
			СтрокаВыписки.OKPOB = ?(Строка(Документ.Контрагент.КодПоЕДРПОУ)="" или Строка(Документ.Контрагент.КодПоЕДРПОУ)=0,Строка(Документ.Контрагент.ИНН),Строка(Документ.Контрагент.КодПоЕДРПОУ));
			СтрокаВыписки.NAMEB = ЗаменаИУкр(Документ.Контрагент.Наименование);
		Иначе
			СтрокаВыписки.OKPOB = Строка(Выборка.КодПоЕДРПОУ);
			СтрокаВыписки.NAMEB = ЗаменаИУкр(Документ.Организация.Наименование);
		КонецЕсли;
		
		СтрокаВыписки.MFOB 		= Строка(Документ.СчетКонтрагента.Банк.Код);
		СтрокаВыписки.SUMMAVKOP = Формат(Документ.СуммаДокумента*100,"ЧГ=;ЧРД=.");
		СтрокаВыписки.GOAL 		= ЗаменаИУкр(СокрЛП(НазначениеПлатежа));
		СтрокаВыписки.VDATE 	= "";
		СтрокаВыписки.DOC_DATE 	= Формат(Документ.Дата, "ДЛФ=Д");
		СтрокаВыписки.DOC_NUM 	= ОбщегоНазначения.ПолучитьНомерНаПечать(Документ);
		СтрокаВыписки.TAX_XML 	= СтрЗаменить(СтрЗаменить(НазначениеПлатежаНалоги, Символы.ПС, ""), Символы.Таб,"");
		
	КонецЦикла;	
		
	ВыгрузкаВDBF(ТаблицаДанных, ПутьКФайлу)		
	
КонецПроцедуры

Процедура ВыгрузитьМонобанк(МассивДокументов, СчетОрганизации)
	
	ПутьФайлаВыгрузки = СчетОрганизации.Банк.ПутьФайлаВыгрузки;
		
	Если НЕ ЗначениеЗаполнено(ПутьФайлаВыгрузки) Тогда
		Возврат;
	КонецЕсли;	
	
	ПутьКаталог = ПутьФайлаВыгрузки + "\"+СчетОрганизации.Владелец+"\"+СчетОрганизации.Банк;
	ПутьКаталог = СтрЗаменить(ПутьКаталог,Символ(34),"");
	СоздатьКаталог(ПутьКаталог);
	ПутьКФайлу = ПутьКаталог+"\export.dbf";
	
	ТабДокумент = Новый ТабличныйДокумент;
	ФайлСуществует = ФайлСуществует(ПутьКФайлу);
	Если ФайлСуществует Тогда
		ТаблицаДанных = ПодготовитьТаблицуСДаннымиDBF(ПутьКФайлу);
		УдалитьФайлы(ПутьКФайлу);
	Иначе
		ТаблицаДанных = Новый ТаблицаЗначений;
		ТаблицаДанных.Колонки.Добавить("n_doc");
		ТаблицаДанных.Колонки.Добавить("mfo_db");
		ТаблицаДанных.Колонки.Добавить("rr_db");
		ТаблицаДанных.Колонки.Добавить("naim_d");
		ТаблицаДанных.Колонки.Добавить("okpo_db");
		ТаблицаДанных.Колонки.Добавить("mfo_cr");
		ТаблицаДанных.Колонки.Добавить("rr_k");
		ТаблицаДанных.Колонки.Добавить("naim_k");
		ТаблицаДанных.Колонки.Добавить("okpo_cr");
		ТаблицаДанных.Колонки.Добавить("sum");
		ТаблицаДанных.Колонки.Добавить("sumeq");
		ТаблицаДанных.Колонки.Добавить("prizn");
		ТаблицаДанных.Колонки.Добавить("dat");
		ТаблицаДанных.Колонки.Добавить("dat_pr");
		ТаблицаДанных.Колонки.Добавить("kod_val");
		ТаблицаДанных.Колонки.Добавить("operat");
		ТаблицаДанных.Колонки.Добавить("dat_gn");
		ТаблицаДанных.Колонки.Добавить("dat_arc");
		ТаблицаДанных.Колонки.Добавить("tim_pr");
	КонецЕсли;	
	
	Для каждого Документ Из МассивДокументов Цикл
	
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ДатаСрез", Документ.Дата);
		Запрос.УстановитьПараметр("Организация", Документ.Организация);
		Запрос.Текст =
				"ВЫБРАТЬ
				|	КодыОрганизацииСрезПоследних.КодПоЕДРПОУ
				|ИЗ
				|	РегистрСведений.КодыОрганизации.СрезПоследних(&ДатаСрез, Организация = &Организация) КАК КодыОрганизацииСрезПоследних";
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если НЕ Выборка.Следующий() Тогда
			Сообщить("РегистрСведений.КодыОрганизации, не найдена запись.");
			Продолжить;
		КонецЕсли;	
		
		НазначениеПлатежа = Документ.НазначениеПлатежа;
		НазначениеПлатежа = СтрЗаменить(НазначениеПлатежа, Символы.ПС, " ");
		НазначениеПлатежа = СтрЗаменить(НазначениеПлатежа, Символы.Таб, " ");
		НазначениеПлатежа = СтрЗаменить(НазначениеПлатежа, Символы.ВТаб, " ");
		НазначениеПлатежа = СтрЗаменить(НазначениеПлатежа, Символы.ВК, " ");
		НазначениеПлатежа = СтрЗаменить(НазначениеПлатежа, Символы.НПП, " ");
		НазначениеПлатежа = СтрЗаменить(НазначениеПлатежа, Символы.ПФ, " ");

		СтрокаВыписки = ТаблицаДанных.Добавить();

		
		СтрокаВыписки.n_doc 	= ОбщегоНазначения.ПолучитьНомерНаПечать(Документ); 
		СтрокаВыписки.mfo_db 	= Строка(Документ.СчетОрганизации.Банк.Код);
		СтрокаВыписки.rr_db 	= Строка(Документ.СчетОрганизации.НомерСчета);
		СтрокаВыписки.naim_d 	= ЗаменаИУкр(Документ.Организация.Наименование);
		СтрокаВыписки.okpo_db 	= Строка(Выборка.КодПоЕДРПОУ);
		
		СтрокаВыписки.mfo_cr 	= Строка(Документ.СчетКонтрагента.Банк.Код);
		СтрокаВыписки.rr_k 		= Строка(Документ.СчетКонтрагента.НомерСчета);
		СтрокаВыписки.naim_k 	= ЗаменаИУкр(Документ.Контрагент.Наименование);
		СтрокаВыписки.okpo_cr 	= Строка(Документ.Контрагент.КодПоЕДРПОУ);
		
		СтрокаВыписки.sum 		= Формат(Документ.СуммаДокумента,"ЧГ=;ЧРД=.");
		СтрокаВыписки.sumeq 	= Формат(Документ.СуммаДокумента,"ЧГ=;ЧРД=.");
		СтрокаВыписки.prizn 	= ЗаменаИУкр(СокрЛП(НазначениеПлатежа));
		СтрокаВыписки.kod_val   = Документ.ВалютаДокумента.Код;
		СтрокаВыписки.operat 	= "2";
	
	КонецЦикла;
			
	ВыгрузкаDBFМонобанк(ТаблицаДанных, ПутьКФайлу);		
	
КонецПроцедуры
// <-- t.me/konstantyn_buhantsev [13 лютого 2025 р.] 


Процедура ОбходнойЛистОтправитьПоПочте(Ссылка,РольИсполнителя) Экспорт
	
		НеобходимоЦФО = Ложь;
		Если РольИсполнителя = Справочники.РолиИсполнителей.обКладовщик Тогда 
			НеобходимоЦФО = Истина;
		КонецЕсли;
	
	
	    ПользовательОтправкиПоПочте = Справочники.Пользователи.НайтиПоНаименованию("Почтовый пользователь", Истина);
		
		СписокПолучателей = Новый СписокЗначений;
		СписокПолучателей.ЗагрузитьЗначения(ПолучитьПользователейПоРолиИЦФО(РольИсполнителя,?(НеобходимоЦФО,Ссылка.Подразделение,Неопределено)));
		
					
		ТекстПисьма = "Обхідний лист на звільнення працівника " + Ссылка.Сотрудник +" № "+Ссылка.Номер +" потребує погодження";
				
		СтрПисьма = Новый Структура;
		СтрПисьма.Вставить("Тело", ТекстПисьма);
		СтрПисьма.Вставить("Тема", "Обхідний лист на звільнення працівника " + Ссылка.Сотрудник +" № "+Ссылка.Номер +" потребує погодження");
		СтрПисьма.Вставить("УчетнаяЗапись", Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("Автоматична система відправки повідоплень"));
		СтрПисьма.Вставить("Кому", СписокПолучателей);
		
		Если СписокПолучателей.Количество() Тогда 
		СтрПисьмо = УправлениеЭлектроннойПочтой.НаписатьПисьмо(ПользовательОтправкиПоПочте, СтрПисьма,,,,,,,Ложь); 
		СтрПисьмо.Письмоссылка.ПолучитьОбъект().ОтправитьПисьмо(,ПользовательОтправкиПоПочте);
		КонецЕсли;
		
КонецПроцедуры

Функция ПолучитьПользователейПоРолиИЦФО(РольИсполнителя,ЦФО)
	
	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИсполнителиЗадач.Исполнитель,
	               |	КонтактнаяИнформация.Представление
	               |ИЗ
	               |	РегистрСведений.ИсполнителиЗадач КАК ИсполнителиЗадач
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |		ПО ИсполнителиЗадач.Исполнитель = КонтактнаяИнформация.Объект
	               |			И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.Служебныйадресэлектроннойпочтыпользователя))
	               |ГДЕ
	               |	ИсполнителиЗадач.РольИсполнителя = &РольИсполнителя
	               |	И ИсполнителиЗадач.ОсновнойОбъектАдресации = &ОсновнойОбъектАдресации
	               |	И (ВЫРАЗИТЬ(КонтактнаяИнформация.Представление КАК СТРОКА(100))) <> """"";
	Запрос.УстановитьПараметр("РольИсполнителя",РольИсполнителя);
	Запрос.УстановитьПараметр("ОсновнойОбъектАдресации",ЦФО);
	
	Возврат запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Представление");
	
КонецФункции

Процедура ПередЗаписьюДокументаАПИПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	//Заказ покупателя
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ЗаказПокупателя") Тогда
		
		#Область vstore
		
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			
			ОтправитьСтатусы(Источник);
			Если ТоварыИзменились(Источник) Тогда
				ОтправитьИзмененияЗаказа(Источник);
			КонецЕсли;
			
		КонецЕсли;
		
		#КонецОбласти
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтправитьСтатусы(Источник)
	
	СоответствиеСтатусов = Новый Соответствие;
	СоответствиеСтатусов.Вставить(Перечисления.СтатусыЗаказаИМ.ВРаботеМенеджера, "2");
	СоответствиеСтатусов.Вставить(Перечисления.СтатусыЗаказаИМ.ВРаботеСервисныхИнженеров, "2");
	СоответствиеСтатусов.Вставить(Перечисления.СтатусыЗаказаИМ.ВРаботеЮО, "2");
	СоответствиеСтатусов.Вставить(Перечисления.СтатусыЗаказаИМ.Отправлено, "11");
	СоответствиеСтатусов.Вставить(Перечисления.СтатусыЗаказаИМ.Завершен, "5");
	СоответствиеСтатусов.Вставить(Перечисления.СтатусыЗаказаИМ.Отклонено, "16");
	
	Если НЕ ЗначениеЗаполнено(Источник.СтатусИМ)
		ИЛИ СоответствиеСтатусов[Источник.СтатусИМ] = Неопределено 
		ИЛИ Источник.СтатусИМ = Источник.Ссылка.СтатусИМ Тогда  //Если статус не менялся то и не надо отправлять еще раз
		Возврат;
	КонецЕсли;
	
	СтрПодключение = Справочники.НастройкиПодключенияКAPI.ПолучитьСтруктуруПодключенияAPI("vstore.net.ua");
	
	Если СтрПодключение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Url = СтрПодключение.Адрес;
	
	ОрдерИД = Сред(Источник.Комментарий, Найти(Источник.Комментарий, "№") +2, 5);
	
	Попытка
		темп_ = Число(Сред(Источник.Комментарий, Найти(Источник.Комментарий, "№") +2, 5));
	Исключение
		Возврат;
	КонецПопытки;
	
	Токен = "";
	Соединение = Новый HTTPСоединение(Url,,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	Заголовки = Новый Соответствие;
	HTTPЗапрос = Новый HTTPЗапрос("index.php?route=api/order_status", Заголовки);
	
	token = ПланыОбмена.Website.НайтиПоНаименованию("vstore.net.ua", Истина).Токен;
	
	ВремГраница = СтрЗаменить(Новый УникальныйИдентификатор, "-", "");
	ТелоЗапроса = Новый ТекстовыйДокумент();
	ТелоЗапроса.РазделительСтрок = Символы.CR + Символы.LF;
	
	ТелоЗапроса.ДобавитьСтроку("--" + ВремГраница);
	ТелоЗапроса.ДобавитьСтроку("Content-Disposition: form-data; name=""token"";");
	ТелоЗапроса.ДобавитьСтроку("");
	ТелоЗапроса.ДобавитьСтроку(token);
	
	ТелоЗапроса.ДобавитьСтроку("--" + ВремГраница);
	ТелоЗапроса.ДобавитьСтроку("Content-Disposition: form-data; name=""order_id"";");
	ТелоЗапроса.ДобавитьСтроку("");
	ТелоЗапроса.ДобавитьСтроку(СтрЗаменить(СокрЛП(Сред(Источник.Комментарий, Найти(Источник.Комментарий, "№") +2, 5)), " ", "")); 
	
	ТелоЗапроса.ДобавитьСтроку("--" + ВремГраница);
	ТелоЗапроса.ДобавитьСтроку("Content-Disposition: form-data; name=""status_id"";");
	ТелоЗапроса.ДобавитьСтроку("");
	ТелоЗапроса.ДобавитьСтроку(СоответствиеСтатусов[Источник.СтатусИМ]);
	
	ТелоЗапроса.ДобавитьСтроку("--" + ВремГраница + "--");
	
	ТелоЗапросаСтрока = ТелоЗапроса.ПолучитьТекст();
	
	HTTPЗапрос.Заголовки["Content-Type"] = "multipart/form-data; boundary=" + ВремГраница;
	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапросаСтрока, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	
	Ответ 	= Соединение.ОтправитьДляОбработки(HTTPЗапрос);	
	мОтвет 	= Ответ.ПолучитьТелоКакСтроку();
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(мОтвет);
	Попытка
		СтруктураОтвета = ПрочитатьJSON(ЧтениеJSON);
	Исключение
		ЗаписьЖурналаРегистрации("vstore.net.ua",УровеньЖурналаРегистрации.Ошибка,,,"Не удалось записать статус в заказе №" + Источник.Номер);
	КонецПопытки;
	ЧтениеJSON.Закрыть();
	
КонецПроцедуры

Процедура ОтправитьИзмененияЗаказа(Источник)
	
	
	
КонецПроцедуры

Функция ТоварыИзменились(Источник) 
	
	ТоварыОб		= Источник.Товары.Выгрузить();
	ТоварыСсылка 	= Источник.Ссылка.Товары.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПокупателяТоварыОбъект.ЕдиницаИзмерения,
		|	ЗаказПокупателяТоварыОбъект.Количество,
		|	ЗаказПокупателяТоварыОбъект.Номенклатура,
		|	ЗаказПокупателяТоварыОбъект.Размещение,
		|	ЗаказПокупателяТоварыОбъект.Сумма,
		|	ЗаказПокупателяТоварыОбъект.СуммаНДС,
		|	ЗаказПокупателяТоварыОбъект.ХарактеристикаНоменклатуры,
		|	ЗаказПокупателяТоварыОбъект.Цена,
		|	ЗаказПокупателяТоварыОбъект.СерияНоменклатуры
		|ПОМЕСТИТЬ ВТ_ТоварыОбъекта
		|ИЗ
		|	&ТоварыОБ КАК ЗаказПокупателяТоварыОбъект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТоварыОбъекта.ЕдиницаИзмерения,
		|	ВТ_ТоварыОбъекта.Количество,
		|	ВТ_ТоварыОбъекта.Номенклатура,
		|	ВТ_ТоварыОбъекта.Размещение,
		|	ВТ_ТоварыОбъекта.Сумма,
		|	ВТ_ТоварыОбъекта.СуммаНДС,
		|	ВТ_ТоварыОбъекта.ХарактеристикаНоменклатуры,
		|	ВТ_ТоварыОбъекта.Цена,
		|	ВТ_ТоварыОбъекта.СерияНоменклатуры
		|ПОМЕСТИТЬ ВТ_ТоварыОбъектИТОГ
		|ИЗ
		|	ВТ_ТоварыОбъекта КАК ВТ_ТоварыОбъекта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказПокупателяТовары.ЕдиницаИзмерения,
		|	-ЗаказПокупателяТовары.Количество КАК Количество,
		|	ЗаказПокупателяТовары.Номенклатура,
		|	ЗаказПокупателяТовары.Размещение,
		|	-ЗаказПокупателяТовары.Сумма КАК Сумма,
		|	-ЗаказПокупателяТовары.СуммаНДС КАК СуммаНДС,
		|	ЗаказПокупателяТовары.ХарактеристикаНоменклатуры,
		|	-ЗаказПокупателяТовары.Цена КАК Цена,
		|	ЗаказПокупателяТовары.СерияНоменклатуры
		|ПОМЕСТИТЬ ВТ_ТоварыСсылка
		|ИЗ
		|	&ТоварыСсылка КАК ЗаказПокупателяТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТоварыСсылка.ЕдиницаИзмерения,
		|	ВТ_ТоварыСсылка.Количество,
		|	ВТ_ТоварыСсылка.Номенклатура,
		|	ВТ_ТоварыСсылка.Размещение,
		|	ВТ_ТоварыСсылка.Сумма,
		|	ВТ_ТоварыСсылка.СуммаНДС,
		|	ВТ_ТоварыСсылка.ХарактеристикаНоменклатуры,
		|	ВТ_ТоварыСсылка.Цена,
		|	ВТ_ТоварыСсылка.СерияНоменклатуры
		|ПОМЕСТИТЬ ВТ_ТоварыСсылкаИТОГ
		|ИЗ
		|	ВТ_ТоварыСсылка КАК ВТ_ТоварыСсылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТоварыОбъектИТОГ.ЕдиницаИзмерения,
		|	ВТ_ТоварыОбъектИТОГ.Количество,
		|	ВТ_ТоварыОбъектИТОГ.Номенклатура,
		|	ВТ_ТоварыОбъектИТОГ.Размещение,
		|	ВТ_ТоварыОбъектИТОГ.Сумма,
		|	ВТ_ТоварыОбъектИТОГ.СуммаНДС,
		|	ВТ_ТоварыОбъектИТОГ.ХарактеристикаНоменклатуры,
		|	ВТ_ТоварыОбъектИТОГ.Цена,
		|	ВТ_ТоварыОбъектИТОГ.СерияНоменклатуры
		|ПОМЕСТИТЬ ВТ_Итог
		|ИЗ
		|	ВТ_ТоварыОбъектИТОГ КАК ВТ_ТоварыОбъектИТОГ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ТоварыСсылкаИТОГ.ЕдиницаИзмерения,
		|	ВТ_ТоварыСсылкаИТОГ.Количество,
		|	ВТ_ТоварыСсылкаИТОГ.Номенклатура,
		|	ВТ_ТоварыСсылкаИТОГ.Размещение,
		|	ВТ_ТоварыСсылкаИТОГ.Сумма,
		|	ВТ_ТоварыСсылкаИТОГ.СуммаНДС,
		|	ВТ_ТоварыСсылкаИТОГ.ХарактеристикаНоменклатуры,
		|	ВТ_ТоварыСсылкаИТОГ.Цена,
		|	ВТ_ТоварыСсылкаИТОГ.СерияНоменклатуры
		|ИЗ
		|	ВТ_ТоварыСсылкаИТОГ КАК ВТ_ТоварыСсылкаИТОГ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Итог.ЕдиницаИзмерения,
		|	СУММА(ВТ_Итог.Количество) КАК Количество,
		|	ВТ_Итог.Номенклатура,
		|	ВТ_Итог.Размещение,
		|	СУММА(ВТ_Итог.Сумма) КАК Сумма,
		|	СУММА(ВТ_Итог.СуммаНДС) КАК СуммаНДС,
		|	ВТ_Итог.ХарактеристикаНоменклатуры,
		|	СУММА(ВТ_Итог.Цена) КАК Цена,
		|	ВТ_Итог.СерияНоменклатуры
		|ПОМЕСТИТЬ ВТ_ИтогСГруппировкой
		|ИЗ
		|	ВТ_Итог КАК ВТ_Итог
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Итог.Номенклатура,
		|	ВТ_Итог.ЕдиницаИзмерения,
		|	ВТ_Итог.СерияНоменклатуры,
		|	ВТ_Итог.ХарактеристикаНоменклатуры,
		|	ВТ_Итог.Размещение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ИтогСГруппировкой.ЕдиницаИзмерения,
		|	ВТ_ИтогСГруппировкой.Количество,
		|	ВТ_ИтогСГруппировкой.Номенклатура,
		|	ВТ_ИтогСГруппировкой.Размещение,
		|	ВТ_ИтогСГруппировкой.Сумма,
		|	ВТ_ИтогСГруппировкой.СуммаНДС,
		|	ВТ_ИтогСГруппировкой.ХарактеристикаНоменклатуры,
		|	ВТ_ИтогСГруппировкой.Цена,
		|	ВТ_ИтогСГруппировкой.СерияНоменклатуры
		|ИЗ
		|	ВТ_ИтогСГруппировкой КАК ВТ_ИтогСГруппировкой
		|ГДЕ
		|	(ВТ_ИтогСГруппировкой.Цена <> 0
		|			ИЛИ ВТ_ИтогСГруппировкой.Сумма <> 0
		|			ИЛИ ВТ_ИтогСГруппировкой.СуммаНДС <> 0
		|			ИЛИ ВТ_ИтогСГруппировкой.Количество <> 0)";

	Запрос.УстановитьПараметр("ТоварыОб", ТоварыОб);
	Запрос.УстановитьПараметр("ТоварыСсылка", ТоварыСсылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой(); //Товары изменились
	
КонецФункции
	

// н ЛИВ
Процедура УстановкаВремениДокумента(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ПлатежноеПоручениеВходящее") И Не ЗначениеЗаполнено(Источник.Ссылка) Тогда
	
		Источник.Дата = НачалоДня(Источник.Дата) + 60*60*9;
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ЗаказПоставщику") И Не ЗначениеЗаполнено(Источник.Ссылка) Тогда
	
		Источник.Дата = НачалоДня(Источник.Дата) + 60*60*7;
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ПоступлениеТоваровУслуг") И Не ЗначениеЗаполнено(Источник.Ссылка) Тогда
	
		Источник.Дата = НачалоДня(Источник.Дата) + 60*60*8;
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ПриходныйОрдерНаТовары") И Не ЗначениеЗаполнено(Источник.Ссылка) Тогда
	
		Источник.Дата = НачалоДня(Источник.Дата) + 60*60*7 + 30*60;
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ПлатежноеПоручениеИсходящее") И Не ЗначениеЗаполнено(Источник.Ссылка) Тогда
	
		Источник.Дата = НачалоДня(Источник.Дата) + 60*60*7;
		
	////ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ОприходованиеТоваров") И Не ЗначениеЗаполнено(Источник.Ссылка) Тогда
	////
	////	Источник.Дата = НачалоДня(Источник.Дата) + 60*60*6;
	////	
	////ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ПоступлениеТоваровУслуг") И Не ЗначениеЗаполнено(Источник.Ссылка) Тогда
	////
	////	Источник.Дата = НачалоДня(Источник.Дата) + 60*60*6;
	////	
	////ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.РеализацияТоваровУслуг") И Не ЗначениеЗаполнено(Источник.Ссылка) Тогда
	////
	////	Источник.Дата = НачалоДня(Источник.Дата) + 60*60*8;
	
	КонецЕсли;
	
	//ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.НалоговаяНакладная") И Не ЗначениеЗаполнено(Источник.Ссылка) Тогда
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.НалоговаяНакладная") И Не ЗначениеЗаполнено(Источник.Ссылка) Тогда
		
		////Если ЗначениеЗаполнено(Источник.ДокументОснование) Тогда 
		////	Источник.Дата = Источник.ДокументОснование.Дата;
		////КонецЕсли;
		
// ТипПричиныНевыдачиПокупателю		
		Если Источник.ТипПричиныНевыдачиПокупателю = 0 Тогда
			мВалютаРегламентированногоУчета   = глЗначениеПеременной("ВалютаРегламентированногоУчета");
			Если Источник.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
				Если глЗначениеПеременной("ДатаВступленияВСилуПриказа1379") > Источник.Дата  Тогда
					Источник.ТипПричиныНевыдачиПокупателю = 2;
				Иначе	
					Источник.ТипПричиныНевыдачиПокупателю = 14;
				КонецЕсли;
			ИначеЕсли Источник.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.СводнаяНаПревышениеБазыНадЦенойПоставки Тогда
				Источник.ТипПричиныНевыдачиПокупателю = 15;
			ИначеЕсли  НЕ Источник.ВалютаДокумента = мВалютаРегламентированногоУчета
				И Источник.ДоговорКонтрагента.Внешнеэкономический = Истина
				И НЕ Источник.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
				ТипПричиныНевыдачиПокупателю = 7;
			ИначеЕсли Источник.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа Тогда
				Если глЗначениеПеременной("ДатаВступленияВСилуПриказа1379") > Источник.Дата  Тогда
					Источник.ТипПричиныНевыдачиПокупателю = 4;
				Иначе	
					Источник.ТипПричиныНевыдачиПокупателю = 13;
				КонецЕсли;
			ИначеЕсли Источник.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажаСписаниеОС Тогда
			    Источник.ТипПричиныНевыдачиПокупателю = 5;
			ИначеЕсли Источник.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОблагаемыеОперации 
				  ИЛИ Источник.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации Тогда
			    Источник.ТипПричиныНевыдачиПокупателю = 11;
			Иначе
				СхемыНалогообложения = РегистрыСведений.СхемыНалогообложенияКонтрагентов.СрезПоследних(Источник.Дата, Новый Структура("Контрагент", Источник.Контрагент));
				Если СхемыНалогообложения.Количество() = 0 Тогда
					ПлательщикНДС = Истина;
				Иначе
					ПлательщикНДС = СхемыНалогообложения[0].СхемаНалогообложения.НДС;
				КонецЕсли;

				Если НЕ ЗначениеЗаполнено(Источник.Контрагент.ИНН)
					ИЛИ Найти("0123456789",Лев(СокрЛ(Источник.Контрагент.ИНН),1)) = 0
					ИЛИ НЕ ПлательщикНДС Тогда		
					Источник.ТипПричиныНевыдачиПокупателю = 2;
				Иначе	
					Источник.ТипПричиныНевыдачиПокупателю = 0;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
// ТипПричиныНевыдачиПокупателю		

	КонецЕсли;
	
КонецПроцедуры	

Процедура ПриЗаписиНалоговойПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	// Вставити вміст обробника.
КонецПроцедуры

Процедура ПередЗаписьюЗаказаПокупателя(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	
	Возврат; //// Віключил віполнение подписки из за того что блокирует обмен с мобильнім приложением
	
	Если ЗначениеЗаполнено(Источник.Ссылка) Тогда
		Если Не РольДоступна("РедактированиеЗаказаПокупателя") Тогда
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("ЗаказПокупателя", Источник.Ссылка);
			Запрос.УстановитьПараметр("ВидОперации", Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ПоступлениеОплатыПоПлатежнымКартам);
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ЧекККМ.Ссылка
			|ИЗ
			|	Документ.ЧекККМ КАК ЧекККМ
			|ГДЕ
			|	ЧекККМ.ЗаказПокупателя = &ЗаказПокупателя
			|	И ЧекККМ.Проведен = ИСТИНА
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка
			|ИЗ
			|	Документ.ПлатежноеПоручениеВходящее.РасшифровкаПлатежа КАК ПлатежноеПоручениеВходящееРасшифровкаПлатежа
			|ГДЕ
			|	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Сделка = &ЗаказПокупателя
			|	И ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка.Проведен = ИСТИНА
			|	И ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка.ВидОперации = &ВидОперации";
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда
				Сообщить(НСтр("ru='Существуют проведенные документы по данному заказу';uk='Існують проведені документи на це замовлення'"), СтатусСообщения.Внимание);		
				Отказ = истина;
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры	

Процедура ПриПроведенииУстановкаВремениОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт

	//Если ТекущаяДата() >= Дата('20260330') Тогда
	//	
	//	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ЗаказПоставщику") И Не ЗначениеЗаполнено(Источник.Ссылка) Тогда
	//	
	//		Источник.Дата = НачалоДня(Источник.Дата) + 60*60*7;
	//		
	//	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ПоступлениеТоваровУслуг") И Не ЗначениеЗаполнено(Источник.Ссылка) Тогда
	//	
	//		Источник.Дата = НачалоДня(Источник.Дата) + 60*60*8;
	//		
	//	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ПриходныйОрдерНаТовары") И Не ЗначениеЗаполнено(Источник.Ссылка) Тогда
	//	
	//		Источник.Дата = НачалоДня(Источник.Дата) + 60*60*7 + 30*60;
	//		
	//	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ПлатежноеПоручениеИсходящее") И Не ЗначениеЗаполнено(Источник.Ссылка) Тогда
	//	
	//		Источник.Дата = НачалоДня(Источник.Дата) + 60*60*7;
	//		
	//	КонецЕсли;
	//	
	//КонецЕсли;

КонецПроцедуры

// к ЛИВ
